# Pandas

In [1]:
import pandas as pd

* Series ---- 1d array
* Data Frame ---- 2d array (Table format,row & col)

In [15]:
a=pd.Series([])
b=pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\ds208\AppData\Local\Temp\ipykernel_15108\3292576525.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [16]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [17]:
a

Series([], dtype: float64)

In [18]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [19]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [20]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [21]:
import numpy as np

In [22]:
n=np.array([1,2,3,4,5])

In [23]:
x=pd.Series(n)

In [24]:
b=pd.Series([1,2,[11,22],33,[12,23],47,58,100])

In [25]:
b

0           1
1           2
2    [11, 22]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [26]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [27]:
d['d']

99

In [28]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [30]:
s=pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [31]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [34]:
s1=pd.Series([12,52,42,10,23],index=list('qwert'))

In [35]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [36]:
s2=pd.Series([12,52,12,52,10,23,42])

In [37]:
s2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
dtype: int64

In [38]:
s2.value_counts()

12    2
52    2
10    1
23    1
42    1
dtype: int64

In [39]:
s2.argmax

<bound method IndexOpsMixin.argmax of 0    12
1    52
2    12
3    52
4    10
5    23
6    42
dtype: int64>

In [40]:
s2.argmax()

1

In [41]:
s2.argmin()

4

In [45]:
s1.idxmax()

'w'

In [46]:
s1.idxmin()

'r'

# DataFrame

In [47]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,55,40,86])

In [48]:
a

Empty DataFrame
Columns: []
Index: []

In [49]:
type(b)

pandas.core.frame.DataFrame

In [50]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [53]:
c= pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[6,7,8,9,10],[26,27,28,29,30],[2,3,4,5,6]])

In [54]:
c

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   6   7   8   9  10
3  26  27  28  29  30
4   2   3   4   5   6

In [55]:
c.head()

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   6   7   8   9  10
3  26  27  28  29  30
4   2   3   4   5   6

In [56]:
c.tail(3)

    0   1   2   3   4
2   6   7   8   9  10
3  26  27  28  29  30
4   2   3   4   5   6

In [58]:
c.sample(2)

    0   1   2   3   4
1  10  20  30  40  50
0   1   2   3   4   5

In [59]:
c1= pd.DataFrame([[1,2,3,4,5],[10,20,30,40],[6,7,8,9,10],[26,27,28,29],[2,3,4,5,6]])

In [60]:
c1

    0   1   2   3     4
0   1   2   3   4   5.0
1  10  20  30  40   NaN
2   6   7   8   9  10.0
3  26  27  28  29   NaN
4   2   3   4   5   6.0

In [77]:
c1= pd.DataFrame([[1,2,3,4,5],[10,'NaN',30,40],[6,7,8,9,10],[26,27,28,29],[2,3,4,5,6]],columns=['colA','colB','colC','colD','colE'])

In [78]:
c1

   colA colB  colC  colD  colE
0     1    2     3     4   5.0
1    10  NaN    30    40   NaN
2     6    7     8     9  10.0
3    26   27    28    29   NaN
4     2    3     4     5   6.0

In [85]:
c1[['colC']].head(3)

   colC
0     3
1    30
2     8

In [86]:
c1.shape

(5, 5)

In [96]:
c1[['colA']].max()

colA    26
dtype: int64

In [97]:
c1['new_col1']=[1,2,3,4,5]

In [98]:
c1['new_col2']=[10,9,8,7,6]

In [99]:
c1

   colA colB  colC  colD  colE  new_col  new_col1  new_col2
0     1    2     3     4   5.0        1         1        10
1    10  NaN    30    40   NaN        2         2         9
2     6    7     8     9  10.0        3         3         8
3    26   27    28    29   NaN        4         4         7
4     2    3     4     5   6.0        5         5         6

In [100]:
c1['colF']=c1['new_col1']+c1['new_col2']

In [101]:
c1

   colA colB  colC  colD  colE  new_col  new_col1  new_col2  colF
0     1    2     3     4   5.0        1         1        10    11
1    10  NaN    30    40   NaN        2         2         9    11
2     6    7     8     9  10.0        3         3         8    11
3    26   27    28    29   NaN        4         4         7    11
4     2    3     4     5   6.0        5         5         6    11

In [125]:
f=c1['colD'] >30

In [126]:
c1[f]

   colA colB  colC  colD  colE  new_col  new_col1  new_col2  colF
1    10  NaN    11    40   NaN        2         2         9    11